app/helpers/homepage_helper.rb

	def getUserCoursesData

		userCourses = Enroll.where(matricola: current_user.matricola).collect { |e| e.materia }
---
SELECT "enrolls".* FROM "enrolls" WHERE "enrolls"."matricola" = $1  [["matricola", 0]]