app/helpers/schedules_helper.rb

	def getSchedule
		userCourses = Enroll.where(matricola: current_user.matricola).collect { |e| e.materia}

		ret = Lecture.where(course: userCourses)

		m = Matrix.build(11,5) { " " };

		dayIdx = 0
		hourIdx = 0

		ret.each do |r|
---
SELECT "enrolls".* FROM "enrolls" WHERE "enrolls"."matricola" = $1  [["matricola", 1743611]]
SELECT "lectures".* FROM "lectures" WHERE "lectures"."course" = $1  [["course", "Elettronica"]]