app/controllers/schedules_controller.rb

  def new
    @enroll  = Enroll.new(params[:enroll])
    @materie = Course.all.order("materia ASC").collect { |c| c.materia}
---
SELECT "courses".* FROM "courses" ORDER BY materia ASC

  def create
    begin
      @enroll  = Enroll.new(:matricola => current_user.matricola, :materia => params[:enroll][:materia])
      ret = @enroll.save!(:validate => false)
---
INSERT INTO "enrolls" ("matricola", "materia", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "matricola","materia"  [["matricola", 1743611], ["materia", "Elettronica"], ["created_at", "2019-11-20 14:46:38.875905"], ["updated_at", "2019-11-20 14:46:38.875905"]]

  def delete_page
    @del_enroll  = Enroll.new(params[:enroll])
	@schedule = Enroll.where(matricola: current_user.matricola).collect { |e| e.materia }
---
SELECT "enrolls".* FROM "enrolls" WHERE "enrolls"."matricola" = $1  [["matricola", 1743611]]

  def delete
	begin
		@del_enroll = Enroll.where(matricola: current_user.matricola, materia: params[:enroll][:materia])
		op = Enroll.delete(@del_enroll)
---
SELECT "enrolls".* FROM "enrolls" WHERE "enrolls"."matricola" = $1 AND "enrolls"."materia" = $2  [["matricola", 1743611], ["materia", "Elettronica"]]
DELETE FROM "enrolls" WHERE "enrolls"."matricola" = 1743611 AND "enrolls"."materia" = 'Elettronica'